"Please Donate" = "Molim Vas, donirajte";

"Donate!" = "Doniraj!";
"This is free software, but it still costs money to write, support, and distribute it. If you enjoy using it, please consider a donation to the authors of this software. It will help to make Cyberduck even better!" = "Bilo je potrebno mnogo noći da se ovaj softver razvije. Ako vam se dopada korišćenje ovog softvera, molimo razmislite o donaciji autoru ovog softvera. Time će Cyberduck postati još bolji!";
"As a contributor to Cyberduck, you receive a registration key that disables this prompt." = "Kao donator Cyberduck-u, dobićete registracioni ključ kojim se uklanja ova poruka.";

"Thank you for using Cyberduck!" = "Hvala što koristite Cyberduck!";

"Later" = "Kasnije";

"Don't show again for this version." = "Ne prikazuj poruku za ovu verziju.";


"Donation Key" = "Registracioni ključ";

